In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('car.csv')

In [3]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [4]:
df.columns

Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4340 entries, 0 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4340 non-null   object
 1   year           4340 non-null   int64
 2   selling_price  4340 non-null   int64
 3   km_driven      4340 non-null   int64
 4   fuel           4340 non-null   object
 5   seller_type    4340 non-null   object
 6   transmission   4340 non-null   object
 7   owner          4340 non-null   object
dtypes: int64(3), object(5)
memory usage: 271.4+ KB

In [6]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [7]:
df.isnull().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [8]:
#1. Name the car which is having the selling price more than 600000.

In [9]:
que_1=df[df['selling_price']>600000]['name']

In [10]:
print('Name of car having selling price more than 600000  ',que_1)

Name of car having selling price more than 600000   8                 Hyundai Creta 1.6 VTVT S
12         Toyota Corolla Altis 1.8 VL CVT
21                Hyundai Creta 1.6 VTVT S
25         Toyota Corolla Altis 1.8 VL CVT
27             Hyundai Venue SX Opt Diesel
                       ...
4311               Toyota Camry Hybrid 2.5
4312                 Maruti Ertiga 1.5 VDI
4313    Ford Endeavour 2.2 Titanium AT 4X2
4332          Mahindra Scorpio S2 7 Seater
4338      Hyundai Creta 1.6 CRDi SX Option
Name: name, Length: 1057, dtype: object

In [11]:
#2. Name the car having manual transmission and also find how much km its driven.

In [12]:
que_2=df[df['transmission']=='Manual']['km_driven']

In [13]:
que_2

0        70000
1        50000
2       100000
3        46000
4       141000
         ...
4335     80000
4336     80000
4337     83000
4338     90000
4339     40000
Name: km_driven, Length: 3892, dtype: int64

In [14]:
#3. Name the list of the car having sold by first owner

In [15]:
df[df['owner']=='First Owner']['name']

0                                      Maruti 800 AC
1                           Maruti Wagon R LXI Minor
2                               Hyundai Verna 1.6 SX
3                             Datsun RediGO T Option
5                               Maruti Alto LX BSIII
                            ...
4324                            Maruti Alto 800 Base
4332                    Mahindra Scorpio S2 7 Seater
4334    Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV
4338                Hyundai Creta 1.6 CRDi SX Option
4339                                Renault KWID RXT
Name: name, Length: 2832, dtype: object

In [16]:
#4. Name the list of car having selling price more than 10lac but manufacturing
#year will be 2010.

In [17]:

df[(df['selling_price'] > 1000000) & (df['year']== 2010)]['name']

163                    Jaguar XJ 5.0 L V8 Supercharged
2685                          Audi Q5 2.0 TFSI Quattro
3782                        Toyota Fortuner 3.0 Diesel
3875    Land Rover Range Rover 4.4 Diesel LWB Vogue SE
Name: name, dtype: object

In [18]:
#5. Find the most expensive car.

In [19]:

df[df['selling_price']== df['selling_price'].max()][['name','selling_price']]

                                          name  selling_price
3872  Audi RS7 2015-2019 Sportback Performance        8900000

In [20]:
#6. Find the most cheapest car.

In [21]:
df['selling_price'].min()

20000

In [22]:
#7.Find tthe car which is max driven

In [23]:
df[df['km_driven'] == df['km_driven'].max()]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
1243,Maruti Swift VXI BSIII,2009,250000,806599,Petrol,Dealer,Manual,First Owner

In [24]:
#7.Find tthe car which is min driven

In [25]:
df['km_driven'].min()

1

In [26]:
#11. How many car who has first owner.

In [27]:
df[df['owner']=='First Owner'].shape[0]

2832

In [28]:
#13. how many car is manul.

In [29]:
df[df['transmission']=='Manual'].shape[0]

3892

In [30]:
#19. which car of petrol is max km_driven

In [31]:
df[df['fuel']=='Petrol']['km_driven'].max()

806599

In [34]:
df[df['km_driven']==df[df['fuel']=='Petrol']['km_driven'].max()]['name']

1243    Maruti Swift VXI BSIII
Name: name, dtype: object

In [35]:
#25. In which year most of the car are sold.and which type of fuel.

In [46]:
x=df['year'].value_counts()

In [51]:
print('the car sold in 2017 Is',x.iloc[0])

the car sold in 2017 Is 466

In [52]:
df[df['year']==2017]['fuel'].max()

'Petrol'

In [53]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [59]:
#iloc

In [60]:
df.iloc[1]

name             Maruti Wagon R LXI Minor
year                                 2007
selling_price                      135000
km_driven                           50000
fuel                               Petrol
seller_type                    Individual
transmission                       Manual
owner                         First Owner
Name: 1, dtype: object

In [61]:
df.iloc[1:4]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner

In [68]:
df.iloc[:,[0,6]]

                                     name transmission
0                           Maruti 800 AC       Manual
1                Maruti Wagon R LXI Minor       Manual
2                    Hyundai Verna 1.6 SX       Manual
3                  Datsun RediGO T Option       Manual
4                   Honda Amaze VX i-DTEC       Manual
...                                   ...          ...
4335  Hyundai i20 Magna 1.4 CRDi (Diesel)       Manual
4336           Hyundai i20 Magna 1.4 CRDi       Manual
4337                  Maruti 800 AC BSIII       Manual
4338     Hyundai Creta 1.6 CRDi SX Option       Manual
4339                     Renault KWID RXT       Manual

[4340 rows x 2 columns]

In [69]:
df.iloc[:,0:7]

,name,year,selling_price,km_driven,fuel,seller_type,transmission
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual
...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual

In [72]:
df.iloc[::,[-1]]

             owner
0      First Owner
1      First Owner
2      First Owner
3      First Owner
4     Second Owner
...            ...
4335  Second Owner
4336  Second Owner
4337  Second Owner
4338   First Owner
4339   First Owner

[4340 rows x 1 columns]

In [74]:
x=df.groupby('owner')

In [75]:
x.max()

,name,year,selling_price,km_driven,fuel,seller_type,transmission
owner,,,,,,,
First Owner,Volvo XC60 D5 Inscription,2020,8900000,806599,Petrol,Trustmark Dealer,Manual
Fourth & Above Owner,Volkswagen Vento New Diesel Highline,2020,700000,245244,Petrol,Individual,Manual
Second Owner,Volkswagen Vento Petrol Highline,2019,4400000,350000,Petrol,Trustmark Dealer,Manual
Test Drive Car,Volkswagen Vento 1.5 TDI Highline BSIV,2020,1350000,24585,Petrol,Dealer,Manual
Third Owner,Volvo XC60 D3 Kinetic,2019,2300000,400000,Petrol,Individual,Manual

In [76]:
x.count()

,name,year,selling_price,km_driven,fuel,seller_type,transmission
owner,,,,,,,
First Owner,2832,2832,2832,2832,2832,2832,2832
Fourth & Above Owner,81,81,81,81,81,81,81
Second Owner,1106,1106,1106,1106,1106,1106,1106
Test Drive Car,17,17,17,17,17,17,17
Third Owner,304,304,304,304,304,304,304

In [77]:
x.mean()

                             year  selling_price     km_driven
owner
First Owner           2014.440678  598636.969633  56015.009887
Fourth & Above Owner  2007.395062  173901.197531  99138.135802
Second Owner          2010.983725  343891.088608  81783.518987
Test Drive Car        2019.529412  954293.941176   4155.000000
Third Owner           2009.338816  269474.003289  99304.506579

In [80]:
x.get_group('First Owner')['fuel'].max()

'Petrol'